{
    "general": {
      "global_time_limit": 24,
      "max_attempts": 2,
      "memory_limit": 10,
      "prompt_meta": "### Instruction:\n{}\n### Response:"
    },
    "town_areas": {
      "Phandalin Town Square": "Town square of the town of Phandalin.",
      "Stonehill Inn": "In the center of town stands a large, newly built roadhouse of fieldstone and rough-hewn timbers. The common room is filled with locals nursing mugs of ale or cider, all of them eyeing you with curiosity.",
      "Barthen's Provisions": "Barthen’s is the biggest trading post in Phandalin. Its shelves stock most ordinary goods and supplies, including backpacks, bedrolls, rope, and rations. The place is open from sunup to sundown.",
      "Edermath Orchard": "A tidy little cottage beside an apple orchard."
    },
    "town_people": {
        "Carson Crimson": {
          "profession": "Carson is a talented glassblower who owns a small studio in Seattle's Fremont neighborhood. He specializes in creating intricate glass sculptures and jewelry.",
          "personality": "Carson is passionate and intense, much like the deep crimson of his favorite color. He's known for his fiery determination and unwavering commitment to his craft.",
          "ambitions": "Carson's ultimate goal is to showcase his glass art in a prestigious gallery. He dreams of having his work appreciated and recognized on an international scale, while preserving the natural beauty of his surroundings in his creations.",
          "personality_MBTI": "ENTJ",
          "star_sign": "Aries",
          "income": "moderate",
          "favorite_pnw_hiking_trail": "Rattlesnake Ledge Trail",
          "hobbies": "competitive rowing, attending glass art workshops",
          "house": "TBD",
          "pronouns": "he/him",
          "starting_location": "Long Table"
        },
        "Azealia Azure": {
          "profession": "Azealia is a marine biologist who works at a research institute in Port Townsend. She's dedicated to studying the rich marine life of the Puget Sound.",
          "personality": "Calm, analytical, and introspective, Azealia embodies the tranquility of the azure waters she studies. She's a deep thinker and a gentle soul who prefers spending time by the water's edge.",
          "ambitions": "Azealia's ambition is to contribute significantly to the understanding and conservation of the marine ecosystem in the region. She hopes to make a positive impact on the delicate balance of life beneath the waves.",
          "personality_MBTI": "INFP",
          "star_sign": "Pisces",
          "income": "moderate",
          "favorite_pnw_hiking_trail": "Ebey's Landing Trail",
          "hobbies": "playing acoustic guitar, stargazing, writing poetry",
          "house": "TBD",
          "pronouns": "she/her",
          "starting_location": "Long Table"
        },
        "Emma Emerald": {
          "profession": "Emma is a botanist and environmental educator working for a non-profit organization in Portland. She's passionate about native plant restoration and sustainable gardening.",
          "personality": "With a heart as green as the emerald forests she loves, Emma is nurturing, patient, and deeply connected to nature. She has a calming presence that draws people to her.",
          "ambitions": "Emma's goal is to create thriving urban green spaces by educating communities about the importance of preserving local plant species. She envisions a greener, more sustainable cityscape for future generations.",
          "personality_MBTI": "ISFJ",
          "star_sign": "Taurus",
          "income": "lower-moderate",
          "favorite_pnw_hiking_trail": "Discovery Park Loop Trail",
          "hobbies": "gardening, birdwatching, volunteering at local farmers' markets",
          "house": "TBD",
          "pronouns": "she/they",
          "starting_location": "Long Table"
        },
        "Goldie Goldenrod": {
          "profession": "Goldie is an adventure photographer based in Vancouver, capturing the breathtaking landscapes of the Pacific Northwest. Their work often focuses on the golden hours of sunrise and sunset.",
          "personality": "Energetic and enthusiastic, Goldie's personality mirrors the vibrant goldenrod hues in their photographs. They're adventurous and constantly seek out new perspectives.",
          "ambitions": "Goldie's ambition is to inspire others to appreciate and protect the natural beauty of the region through their photography. They dream of publishing a book that showcases the diversity and magnificence of the Pacific Northwest.",
          "personality_MBTI": "ENFP",
          "star_sign": "Gemini",
          "income": "lower-moderate",
          "favorite_pnw_hiking_trail": "Lake Serene Trail",
          "hobbies": "rock climbing, creating mixed-media art, attending music festivals",
          "house": "TBD",
          "pronouns": "he/they",
          "starting_location": "Long Table"
        },
        "Indie Indigo": {
          "profession": "Indie is a talented musician who plays hauntingly beautiful melodies on her violin in the streets of Seattle's Pike Place Market.",
          "personality": "With an air of mystery and introspection, Indie embodies the enigmatic depth of the indigo color. She's introverted but possesses a unique ability to convey emotions through her music.",
          "ambitions": "Indie's goal is to touch the hearts of those who listen to her music and create an emotional connection. She dreams of composing her own album that captures the essence of the city and its people.",
          "personality_MBTI": "INFJ",
          "star_sign": "Scorpio",
          "income": "moderate",
          "favorite_pnw_hiking_trail": "Franklin Falls Trail",
          "hobbies": "sketching, reading mystery novels, practicing meditation",
          "house": "TBD",
          "pronouns": "she/they",
          "starting_location": "Long Table"
        },
        "Cora Coral": {
          "profession": "Cora is a marine conservationist working to protect the fragile coral reefs along the Oregon coast.",
          "personality": "Energetic, optimistic, and full of life, Cora's personality reflects the vibrant coral shades. She's a social activist who actively engages with her community to raise awareness about ocean conservation.",
          "ambitions": "Cora's ambition is to lead restoration efforts that help the Pacific Northwest's coral ecosystems thrive. She envisions a future where coral reefs can withstand the challenges of climate change and human impact.",
          "personality_MBTI": "ESFP",
          "star_sign": "Leo",
          "income": "upper-moderate",
          "favorite_pnw_hiking_trail": "Haystack Rock Trail",
          "hobbies": "scuba diving, organizing beach cleanups, salsa dancing",
          "house": "TBD",
          "pronouns": "she/her",
          "starting_location": "Long Table"
        },
        "Sam Slate": {
          "profession": "Sam is an architect based in Tacoma, renowned for designing modern, sustainable structures that blend seamlessly with the urban landscape.",
          "personality": "Practical and composed, Sam embodies the balanced, grounded nature of slate. He's a problem solver and a visionary who values functionality and aesthetics equally.",
          "ambitions": "Sam's goal is to create sustainable urban spaces that enhance the lives of residents while respecting the natural surroundings. He aims to design a landmark building that symbolizes the integration of human-made structures and the environment.",
          "personality_MBTI": "ISTJ",
          "star_sign": "Capricorn",
          "income": "upper-moderate",
          "favorite_pnw_hiking_trail": "Mount Si Trail",
          "hobbies": "woodworking, photography, brewing craft beer",
          "house": "TBD",
          "pronouns": "he/him",
          "starting_location": "Long Table"
        },
        "Ashley Amber": {
          "profession": "Ashley is a forest ranger in the Olympic National Park, responsible for maintaining the trails and educating visitors about the unique flora and fauna.",
          "personality": "Warm, nurturing, and deeply connected to nature, Ashley embodies the comforting hues of amber. He's a natural teacher who finds joy in sharing his knowledge with others.",
          "ambitions": "Ashley's ambition is to ensure the preservation of the Pacific Northwest's diverse ecosystems. He hopes to inspire people to cherish the wilderness and take an active role in protecting it for future generations.",
          "personality_MBTI": "ENFJ",
          "star_sign": "Virgo",
          "income": "lower-moderate",
          "favorite_pnw_hiking_trail": "Sol Duc Falls Trail",
          "hobbies": "wildlife photography, teaching outdoor survival skills, playing the flute",
          "house": "TBD",
          "pronouns": "he/they",
          "starting_location": "Long Table"
        }
      }
}
  